chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
/**************************************************
 * USB Device Layer Function Driver Registration 
 * Table
 **************************************************/
const USB_DEVICE_FUNCTION_REGISTRATION_TABLE funcRegistrationTable[3] ={
    /* Function 1 */
    {
        .configurationValue = 1, /* Configuration value */
        .interfaceNumber = 0, /* First interfaceNumber of this function */
        .speed = USB_SPEED_FULL, /* Function Speed */
        .numberOfInterfaces = 2, /* Number of interfaces */
        .funcDriverIndex = 0, /* Index of CDC Function Driver */
        .driver = (void*) USB_DEVICE_CDC_FUNCTION_DRIVER, /* USB CDC function data exposed to device layer */
        .funcDriverInit = (void*) &cdcInit0 /* Function driver init data */
    },
    /* Function 2 */
    {
        .configurationValue = 1, /* Configuration value */
        .interfaceNumber = 2, /* First interfaceNumber of this function */
        .speed = USB_SPEED_FULL, /* Function Speed */
        .numberOfInterfaces = 2, /* Number of interfaces */
        .funcDriverIndex = 1, /* Index of CDC Function Driver */
        .driver = (void*) USB_DEVICE_CDC_FUNCTION_DRIVER, /* USB CDC function data exposed to device layer */
        .funcDriverInit = (void*) &cdcInit1 /* Function driver init data */
    },
    /* Function 3 */
    {
        .configurationValue = 1, /* Configuration value */
        .interfaceNumber = 4, /* First interfaceNumber of this function */
        .speed = USB_SPEED_FULL, /* Function Speed */
        .numberOfInterfaces = 1, /* Number of interfaces */
        .funcDriverIndex = 0, /* Index of HID Function Driver */
        .driver = (void*) USB_DEVICE_HID_FUNCTION_DRIVER, /* USB HID function data exposed to device layer */
        .funcDriverInit = (void*) &hidInit0, /* Function driver init data */
    },
};

/*******************************************
 * USB Device Layer Descriptors
 *******************************************/

/*******************************************
*  USB Device Qualifier Descriptor for this
*  demo.
*******************************************/
const USB_DEVICE_QUALIFIER deviceQualifierDescriptor1 =
{
	0x0A,                               // Size of this descriptor in bytes
	USB_DESCRIPTOR_DEVICE_QUALIFIER,    // Device Qualifier Type
	0x0200,                             // USB Specification Release number
	0xEF,                           // Class Code
	0x02,                           // Subclass code
	0x01,                           // Protocol code
	USB_DEVICE_EP0_BUFFER_SIZE,         // Maximum packet size for endpoint 0
	0x01,                               // Number of possible configurations
	0x00                                // Reserved for future use.
};

/*******************************************
 *  USB Device Descriptor 
 *******************************************/
const USB_DEVICE_DESCRIPTOR deviceDescriptor ={
    0x12, // Size of this descriptor in bytes
    USB_DESCRIPTOR_DEVICE, // DEVICE descriptor type
    0x0200, // USB Spec Release Number in BCD format
    0xEF, // Class Code
    0x02, // Subclass code
    0x01, // Protocol code
    USB_DEVICE_EP0_BUFFER_SIZE, // Max packet size for EP0, see system_config.h
    0x04D8, // Vendor ID
    0x0208, // Product ID
    0x0100, // Device release number in BCD format
    0x01, // Manufacturer string index
    0x02, // Product string index
    0x03, // Device serial number string index
    0x01 // Number of possible configurations
};


/*******************************************
 *  USB Full Speed Configuration Descriptor
 *******************************************/
const uint8_t fullSpeedConfigurationDescriptor[] ={
    /* Configuration Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_DESCRIPTOR_CONFIGURATION, // Descriptor Type
    173, 0, //(173 Bytes)Size of the Config descriptor.e
    5, // Number of interfaces in this cfg
    0x01, // Index value of this configuration
    0x00, // Configuration string index
    USB_ATTRIBUTE_DEFAULT | USB_ATTRIBUTE_SELF_POWERED, // Attributes
    250, // Max power consumption (2X mA)
    /* Descriptor for Function 1 - CDC     */
    /* Interface Association Descriptor: CDC Function 1*/
    0x08, // Size of this descriptor in bytes
    0x0B, // Interface association descriptor type
    0, // The first associated interface
    0x02, // Number of contiguous associated interface
    0x02, // bInterfaceClass of the first interface
    0x02, // bInterfaceSubclass of the first interface
    0x00, // bInterfaceProtocol of the first interface
    0x00, // Interface string index

/*********************************************************
 *                   FIRST CDC/ACM PORT                  *
 *********************************************************/
    /* Interface Descriptor */

    0x09, // Size of this descriptor in bytes
    USB_DESCRIPTOR_INTERFACE, // Descriptor Type
    0, // Interface Number
    0x00, // Alternate Setting Number
    0x01, // Number of endpoints in this interface
    USB_CDC_COMMUNICATIONS_INTERFACE_CLASS_CODE, // Class code
    USB_CDC_SUBCLASS_ABSTRACT_CONTROL_MODEL, // Subclass code
    USB_CDC_PROTOCOL_NO_CLASS_SPECIFIC, // Protocol code
    0x00, // Interface string index

    /* CDC Class-Specific Descriptors */

    sizeof (USB_CDC_HEADER_FUNCTIONAL_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_HEADER, // Type of functional descriptor
    0x20, 0x01, // CDC spec version

    sizeof (USB_CDC_ACM_FUNCTIONAL_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_ABSTRACT_CONTROL_MANAGEMENT, // Type of functional descriptor
    USB_CDC_ACM_SUPPORT_LINE_CODING_LINE_STATE_AND_NOTIFICATION, // bmCapabilities of ACM

    sizeof (USB_CDC_UNION_FUNCTIONAL_DESCRIPTOR_HEADER) + 1, // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_UNION, // Type of functional descriptor
    0, // com interface number
    1,

    sizeof (USB_CDC_CALL_MANAGEMENT_DESCRIPTOR), // Size of the descriptor
    USB_CDC_DESC_CS_INTERFACE, // CS_INTERFACE
    USB_CDC_FUNCTIONAL_CALL_MANAGEMENT, // Type of functional descriptor
    0x00, // bmCapabilities of CallManagement
    1, // Data interface number

    /* Interrupt Endpoint (IN)Descriptor */

    0x07, // Size of this descriptor
    USB_DESCRIPTOR_ENDPOINT, // Endpoint Descriptor
    1 | USB_EP_DIRECTION_IN, // EndpointAddress ( EP1 IN INTERRUPT)
    USB_TRANSFER_TYPE_INTERRUPT, // Attributes type of EP (INTERRUPT)
    0x10, 0x00, // Max packet size of this EP
    0x01, // Interval (in ms)

