chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
};

/*******************************************
 * Array of Full speed config descriptors
 *******************************************/
USB_DEVICE_CONFIGURATION_DESCRIPTORS_TABLE fullSpeedConfigDescSet[1] ={
    fullSpeedConfigurationDescriptor
};


/**************************************
 *  String descriptors.
 *************************************/

/*******************************************
 *  Language code string descriptor
 *******************************************/
const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type 
    uint16_t string[1]; // String
}

sd000 ={
    0, // Index of this string is 0
    0, // This field is always blank for String Index 0
    sizeof (sd000) - sizeof (sd000.stringIndex) - sizeof (sd000.languageID),
    USB_DESCRIPTOR_STRING,
    {
        0x0409} // Language ID
};

/*******************************************
 *  Manufacturer string descriptor
 *******************************************/
#ifndef _USB_MANUFACTURER_
#define _USB_MANUFACTURER_ 'c','h','i','p','K','I','T'
#define _USB_MANUFACTURER_LENGTH_ 7
#endif
const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type
    uint16_t string[_USB_MANUFACTURER_LENGTH_]; // String
}

sd001 ={
    1, // Index of this string descriptor is 1. 
    0x0409, // Language ID of this string descriptor is 0x0409 (English)
    sizeof (sd001) - sizeof (sd001.stringIndex) - sizeof (sd001.languageID),
    USB_DESCRIPTOR_STRING,
    {
        _USB_MANUFACTURER_
    }
};

/*******************************************
 *  Product string descriptor
 *******************************************/

#ifndef _USB_PRODUCT_
#define _USB_PRODUCT_ 'M', 'P', 'I', 'D', 'E', ' ', 'C', 'o', 'm', 'p', 'a', 't', 'i', 'b', 'l', 'e', ' ', 'D', 'e', 'v', 'i', 'c', 'e'
#define _USB_PRODUCT_LENGTH_ 23
#endif

const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type 
    uint16_t string[_USB_PRODUCT_LENGTH_]; // String
}
sd002 ={
    2, // Index of this string descriptor is 2. 
    0x0409, // Language ID of this string descriptor is 0x0409 (English)
    sizeof (sd002) - sizeof (sd002.stringIndex) - sizeof (sd002.languageID),
    USB_DESCRIPTOR_STRING,
    {
        _USB_PRODUCT_
    }
};

/*******************************************
 *  Product string descriptor
 *******************************************/
struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type 
    uint16_t string[14]; // String
}
sd003 ={
    3, // Index of this string descriptor is 3. 
    0x0409, // Language ID of this string descriptor is 0x0409 (English)
    sizeof (sd003) - sizeof (sd003.stringIndex) - sizeof (sd003.languageID),
    USB_DESCRIPTOR_STRING,
    {
        'C', 'K', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'
    }
};


/***************************************
 * Array of string descriptors
 ***************************************/
USB_DEVICE_STRING_DESCRIPTORS_TABLE stringDescriptors[4] ={
    (const uint8_t * const) &sd000,
    (const uint8_t * const) &sd001,
    (const uint8_t * const) &sd002,
    (uint8_t *) &sd003
};


/*******************************************
 * USB Device Layer Master Descriptor Table 
 *******************************************/
const USB_DEVICE_MASTER_DESCRIPTOR usbMasterDescriptor ={
    &deviceDescriptor, /* Full speed descriptor */
    1, /* Total number of full speed configurations available */
    fullSpeedConfigDescSet, /* Pointer to array of full speed configurations descriptors*/
    NULL,
    0,
    NULL,
    4, // Total number of string descriptors available.
    stringDescriptors, // Pointer to array of string descriptors.
	NULL,	// full speed device qualifier
    NULL
};


/****************************************************
 * USB Device Layer Initialization Data
 ****************************************************/
const USB_DEVICE_INIT usbDevInitData ={
    /* System module initialization */
    .moduleInit =
    {SYS_MODULE_POWER_RUN_FULL},

    /* Number of function drivers registered to this instance of the
       USB device layer */
    .registeredFuncCount = 3,

    /* Function driver table registered to this instance of the USB device layer*/
    .registeredFunctions = (USB_DEVICE_FUNCTION_REGISTRATION_TABLE*) funcRegistrationTable,

    /* Pointer to USB Descriptor structure */
    .usbMasterDescriptor = (USB_DEVICE_MASTER_DESCRIPTOR*) & usbMasterDescriptor,

    /* USB Device Speed */
    .deviceSpeed = USB_SPEED_FULL,

#if defined(USB_DRV_HS)
	/* Index of the USB Driver to be used by this Device Layer Instance */
	.driverIndex = DRV_USBHS_INDEX,

	/* Pointer to the USB Driver Functions. */
	.usbDriverInterface = DRV_USBHS_DEVICE_INTERFACE,
#else
    /* Index of the USB Driver to be used by this Device Layer Instance */
	.driverIndex = DRV_USBFS_INDEX,

    /* Pointer to the USB Driver Functions. */
    .usbDriverInterface = DRV_USBFS_DEVICE_INTERFACE,
#endif
};

// </editor-fold>

// *****************************************************************************
// *****************************************************************************
// Section: Driver Initialization Data
// *****************************************************************************
// *****************************************************************************

//<editor-fold defaultstate="collapsed" desc="DRV_USB Initialization Data">

#if defined(USB_DRV_HS)

